// lib/badwords.ts
import leoProfanity from "leo-profanity";

const koreanBadWords = [
  "시발", "씨발", "씨팔", "ㅅㅂ", "ㅆㅂ", "시벌", "시부랄", "씨바", "씹", "좆", "ㅈ같", "존나",
  "좇", "쥰내", "졸라", "조까", "개새끼", "개년", "미친놈", "미친년", "미친새끼", "ㅁㅊ", "병신", "ㅂㅅ",
  "ㅄ", "병신새끼", "썅", "좆같", "쌍놈", "쌍년", "염병", "엠병", "옘병", "지랄", "지럴", "지ㄹ", "찐따",
  "빠가", "멍청이", "돌아이", "정신병자", "정신병", "개놈", "개같", "개지랄", "개자식", "개간나", "개쉐이",
  "개쉑", "개색", "개세", "새끼", "새꺄", "색히", "색기", "느금마", "느그엄마", "니애미", "니에미",
  "니애비", "니아빠", "니엄마", "애미", "애비", "애미뒤짐", "ㅂㄹ", "빨갱이", "노무노무", "좆까",
  "좃까", "좆밥", "좆만한", "좃만한", "걸레년", "걸레같", "보지", "보쥐", "보지년", "보짓", "씹년",
  "씹새", "씹세", "씹물", "씹보", "따먹", "딸딸이", "딸딸", "꼴리", "꼴려", "꼴리는", "꼴렸", "흑형",
  "년놈", "10새끼", "10새", "10년", "10놈", "18놈", "18년", "18새끼", "18새"
];

leoProfanity.add(koreanBadWords);

export default leoProfanity;
